
&После("ПриОпределенииКомандЗаполненияПодключенныхКОбъекту")
Процедура КЛМН_ПриОпределенииКомандЗаполненияПодключенныхКОбъекту(Команды, ИОМы, БыстрыйПоискПоИОМам)
	
	ВидОбработкиЗаполнениеОбъектов = "ЗаполнениеОбъектов"; // Хмм... ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиЗаполнениеОбъекта();
	СпособВызоваЗаполнениеФормы = Перечисления.СпособыВызоваДополнительныхОбработок.ЗаполнениеФормы;
	СпособВызоваВызовКлиентскогоМетода = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовКлиентскогоМетода;
	
	Для Каждого Команда Из Команды Цикл
		
		Если Не Команда.Вид = ВидОбработкиЗаполнениеОбъектов Тогда
			Продолжить;
		КонецЕсли;
		
		ДополнительныеПараметры = Команда.ДополнительныеПараметры;
		
		Если ДополнительныеПараметры.ВариантЗапуска = СпособВызоваЗаполнениеФормы
			И (СтрЗаканчиваетсяНа(ДополнительныеПараметры.Идентификатор, "Клиент")
				Или СтрЗаканчиваетсяНа(ДополнительныеПараметры.Идентификатор, "НаКлиенте")) Тогда
			
			ДополнительныеПараметры.ВариантЗапуска = СпособВызоваВызовКлиентскогоМетода;
			Команда.Обработчик = "ДополнительныеОтчетыИОбработкиКлиент.ОбработчикКомандыЗаполнения";
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
